@extends('includes.default')

@section('main')
    <section id="about" class="border border-1 rounded-2 p-3 mb-4">
        <h2>Про Театральний Портал</h2>
        <p>Ласкаво просимо до нашого Театральний Порталу!</p>
        <p>
            Театральний Портал - це ваш пропуск у захоплюючий світ театрального мистецтва. Ми пропонуємо широкий вибір
            вистав для всіх смаків та вікових категорій. На нашому порталі ви можете дізнатися про найновіші театральні
            події, отримати <a href="{{ route('shows') }}">афішу</a> вистав та придбати квитки онлайн.
        </p>
    </section>

    <section id="services" class="border border-1 rounded-2 p-3 mb-4">
        <h2>Наші послуги</h2>
        <ul>
            <li>Детальна <a href="{{ route('shows') }}">афішу</a> театральних подій</li>
            <li>Купівля квитків онлайн</li>
            <li>Емоції та захоплення від неповторного театрального досвіду</li>
        </ul>
    </section>

    <section id="contact" class="border border-1 rounded-2 p-3">
        <h2>Зв'яжіться з нами</h2>
        <p>Ми завжди раді вам! З питань покупки квитків чи отримання додаткової інформації, будь ласка, звертайтеся за
            <a href="{{ route('contacts') }}">контактними даними</a>, вказаними на нашому порталі.</p>
    </section>
@endsection
